# функция, которая создает список исходя из двух аргументов
a = int(input("Укажите длину списка "))
b = int(input("Укажите максимально возможное значение элемента списка "))
import random
def my_function():
    print(list(x))
x = (random.choices(range(b), k=a))
my_function()